![](Houston.jpg)

## Part 3

In [37]:
%%sql DROP TABLE IF EXISTS time;
CREATE TABLE time (
    date TIMESTAMP,
    hour CHAR(4)
    )

Done.
Done.

[]

In [39]:
!csvcut -c1,2 crimeData.csv > time.csv

In [40]:
!csvcut -n time.csv

  1: Date
  2: Hour

In [41]:
%%sql
COPY time FROM '/home/jovyan/work/time.csv'
CSV
HEADER
QUOTE '"'
DELIMITER ',';

86769 rows affected.

[]

In [42]:
%%sql
SELECT * FROM time
LIMIT 5;

5 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0), '10  '),
 (datetime.datetime(2016, 1, 1, 0, 0), '23  '),
 (datetime.datetime(2016, 1, 1, 0, 0), '18  '),
 (datetime.datetime(2016, 1, 1, 0, 0), '18  '),
 (datetime.datetime(2016, 1, 1, 0, 0), '2   ')]

In [43]:
%%sql 
ALTER TABLE time
ADD COLUMN time_key SERIAL PRIMARY
KEY;

Done.

[]

In [44]:
%%sql
SELECT * FROM time
LIMIT 5;

5 rows affected.

[(datetime.datetime(2016, 1, 1, 0, 0), '10  ', 1),
 (datetime.datetime(2016, 1, 1, 0, 0), '23  ', 2),
 (datetime.datetime(2016, 1, 1, 0, 0), '18  ', 3),
 (datetime.datetime(2016, 1, 1, 0, 0), '18  ', 4),
 (datetime.datetime(2016, 1, 1, 0, 0), '2   ', 5)]

In [45]:
%%sql DROP TABLE IF EXISTS offense;
CREATE TABLE offense (
    offense_type VARCHAR(42)
    )

Done.
Done.

[]

In [47]:
!csvcut -c3 crimeData.csv > offense.csv

In [48]:
%%sql
COPY offense FROM '/home/jovyan/work/offense.csv'
CSV
HEADER
QUOTE '"'
DELIMITER ',';

86769 rows affected.

[]

In [49]:
%%sql 
ALTER TABLE offense
ADD COLUMN offense_key SERIAL PRIMARY
KEY;

Done.

[]

In [50]:
%%sql
SELECT * FROM offense
LIMIT 5;

5 rows affected.

[('Burglary', 1),
 ('Theft', 2),
 ('Aggravated Assault', 3),
 ('Auto Theft', 4),
 ('Burglary', 5)]

In [51]:
%%sql DROP TABLE IF EXISTS location;
CREATE TABLE location (
    Beat VARCHAR(20),
    Premise VARCHAR(64),
    BlockRange VARCHAR(20),
    StreetName VARCHAR(64)
    )

Done.
Done.

[]

In [52]:
!csvcut -c4,5,6,7 crimeData.csv > location.csv

In [53]:
%%sql
COPY location FROM '/home/jovyan/work/location.csv'
CSV
HEADER
QUOTE '"'
DELIMITER ',';

86769 rows affected.

[]

In [54]:
%%sql 
ALTER TABLE location
ADD COLUMN location_key SERIAL PRIMARY
KEY;

Done.

[]

In [55]:
%%sql
SELECT * FROM location
LIMIT 5;

5 rows affected.

[('10H10', 'Restaurant or Cafeteria', '300-399', 'LOCKWOOD', 1),
 ('10H30', 'Road, Street, or Sidewalk', '1000-1099', 'BASTROP', 2),
 ('10H40', 'Road, Street, or Sidewalk', '1700-1799', 'ELGIN', 3),
 ('10H40', 'Other Parking Lot', '3000-3099', 'TRAVIS', 4),
 ('10H40', 'Grocery Store or Supermarket', '4200-4299', 'SAN JACINTO', 5)]

In [56]:
%%sql
DROP TABLE IF EXISTS facts;
CREATE TABLE facts (
    Number_offenses INT,
    offense_id INT,
    time_id INT,
    location_id INT,
    FOREIGN KEY (offense_id) REFERENCES offense(offense_key),
    FOREIGN KEY (time_id) REFERENCES time(time_key),
    FOREIGN KEY (location_id) REFERENCES location(location_key)
    )

Done.
Done.

[]